# 1. Реализовать функцию, принимающую два числа (позиционные аргументы) и выполняющую их деление.
# Числа запрашивать у пользователя, предусмотреть обработку ситуации деления на ноль.
#
# def devided_func(x,y):
#     return x//y
#
# print(devided_func(20,20))

# 2.Реализовать функцию, принимающую несколько параметров, описывающих
# данные пользователя: имя, фамилия, год рождения, город проживания, email, телефон.
# Функция должна принимать параметры как именованные аргументы.
# Реализовать вывод данных о пользователе одной строкой.
#
# def contact_func(name,surename,year,city,email,number_phone):
#     return name,surename,year,city,email,number_phone
#
# print(contact_func(name='Baurzhan',surename='Bexeitov',year='1984',city='Astan',email='bba@mail.ru',number_phone='999'))

# 3. Реализовать функцию my_func(), которая принимает три позиционных аргумента, и возвращает сумму наибольших двух аргументов.
#
# def my_func(x,y):
#     print(max(x,y))
#
#
# print(my_func(50,10))

# 4. Программа принимает действительное положительное число x и целое отрицательное число y.
# Необходимо выполнить возведение числа x в степень y.
# Задание необходимо реализовать в виде функции my_func(x, y).
# При решении задания необходимо обойтись без встроенной функции возведения числа в степень.
#
# def my_func(x,y):
#     return x**y
#
# print(my_func(5,2))